app/controllers/games_controller.rb

    def create
        game = Game.create(score: params['score'], user_id: params['user_id'], level_id: params['level_id'])
---
INSERT INTO "games" ("score", "level_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["score", 0], ["level_id", 3], ["user_id", 5], ["created_at", "2021-01-29 17:16:17.574551"], ["updated_at", "2021-01-29 17:16:17.574551"]]

    def destroy
        game = Game.find(params[:id])
        game.destroy
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 44], ["LIMIT", 1]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 44]]