app/controllers/games_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
    def create
        game = Game.create(score: params['score'], user_id: User.last.id, level_id: params['level_id'])