app/controllers/levels_controller.rb

SELECT "levels".* FROM "levels"
---
    def index
        levels = Level.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "levels".* FROM "levels" WHERE "levels"."level" = ? LIMIT ?  [["level", "beginner"], ["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE "games"."level_id" = ?  [["level_id", 1]]
---
    def create
        user = User.find(params["id"])

        if user.games == []
            level = Level.find_by(level: Level.first.level)
        else
            level = Level.find_by(level: user.games.last.level.level)