app/controllers/levels_controller.rb

INSERT INTO "levels" ("level", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["level", 0], ["created_at", "2021-01-29 17:16:17.476697"], ["updated_at", "2021-01-29 17:16:17.476697"]]
---
    def create
        level = Level.find_or_create_by(level: params['level'])