app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Jennifer"], ["created_at", "2021-01-29 17:16:13.707228"], ["updated_at", "2021-01-29 17:16:13.707228"]]
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Emma"], ["LIMIT", 1]]
---
    def create
        user = User.find_or_create_by(name: params['name'])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Jenn"], ["updated_at", "2021-01-29 17:17:23.023291"], ["id", 5]]
---
    def update
        user = User.find(params[:id])
        user.update(name: params[:name])